#黑马课程-第一天,键盘输入输出、字符类型/字符拼接和运算符
# views = 0
# time = 9
#多个变量可以使用sql中的格式定义值
import decimal

views,time = 0,9

for c in range(3):
    views += 100
    time += 1
    print(time,"月的播放量是",views)

#案例1:现有两个变量，分别为:a=10，b=20，现需要将这两个变量值交换，然后输出到控制台。
#变量值交换需要额外变量参与，比如两杯饮料需要互换容器，就需要一个额外的容器才能完成
a,b,c = 10,20,None
c = a
a = b
b = c
print(f"a={a}；b={b}；c={c}")

#案例2:现有3个变量，分别为:a=100，b=200，c=300现需要将这3个变量值交换c、a、b，然后输出到控制台。
a,b,c,d = 100,200,300,None
d = a
a = b
b = c
c = d
print(f"a={a}；b={b}；c={c}；d={d}")

#变量定义时使用单引号双引号都可定义字符串类型；使用三引号时可以定义换行的字符串
x="双引号定义字符串"
print(x)
y='单引号定义字符串'
print(y)
z="""
您好
    尊贵的新手Python初学者
    这是一封换行的自定义变量z，他总共包含了4行内容
                            这是最后一行
"""
print(z)

#转移字符"\"，比如说变量值为  It's very interesting 其中包含了一个单引号，定义时则会出错
# str = 'It's very interesting'
# print(str)
#所以需要加斜杠转义,双引号同理。在需要转移的字符左侧加斜杠，另外\n是换行，\t是制表符，类似按一下tab键，缩进宽度
str_2 = 'It\'s very \tinteresting'
print(str_2)
#当然，也可以在定义时最外层使用双引号避免该种问题，只是后续若无法避免时，也可以用转义解决
# str = "It's very interesting"
# print(str)

#字符串的拼接，使用str()，将int类型转换为字符串类型
name = "婷婷"
age = 18
sex = '女'
#拼接只适用于str字符串类型，当age为int类型时，该写法就会报错，
# print(name+"的性别是"+sex+"；她总喜欢说她是"+age+"岁！")

#此时就需要将int类型转换为str类型,注意定义变量时需要避免变量名为str，否则str()写法无法转换，会识别为变量名
print(name+"的性别是"+sex+"；她总喜欢说她是"+str(age)+"岁！")

#当然，f""拼接写法更好用，我个人更喜欢
print(F"{name}的性别是{sex}，她总喜欢说她是{age}岁！")

#还有一种"%s"占位符写法,从左到右按顺序一一对应取值
print("%s的性别是%s；她总喜欢说她是%s岁！" % (name,sex,age))

# 获取键盘输入，需使用input；即代码执行后可以在控制台输入内容,无论输入的什么内容，都会获取为字符串类型:
# 案例：小智的银行卡中有10000元，现在到ATM进行取钱操作，请根据输入的金额执行取钱操作，取钱完毕后，展示其银行卡余额。
# 步骤:1.输入密码  2.输入取款金额  3.计算余额并输出
# total = 10000
# password = input("请输入您的密码：")
# money = input("请输入您的取款额度：")
# print(f"您输入的密码是{password}，本次您要求取款{money}元，您的余额还有{total-int(money)}")

#如果money输入的是小数，则需要将其改为{total-float(money)}，或者，变量定义时直接转换
# money = float(input("请输入您的取款额度："))
# print(f"您输入的密码是{password}，本次您要求取款{money}元，您的余额还有{total-money}")

# 算数运算符(+-*/加减乘除之外，还有):
#"%"取除法余数，结果应为"1"
print(f"[10%3]的意思是除法取余数，即10/3=3余1，所以结果应为1，验证结果：{10%3}")
#"//"取除法整数，结果应为"3"
print(f"[10//3]的意思是除法取整数，即10/3=3余1，所以结果应为3，验证结果：{10//3}")
#"**"指数（次方），结果应为"1000"
print(f"[10**3]的意思是10的3次方，即10*10*10=1000，所以结果应为1000，验证结果：{10**3}")

#运算符优先级：括号优先级最高，其次先指数，再其他算法，最后加减！！
print("0.1+10/4**2=0.725,算法详情：0.1+10/（4x4x4），即0.1加10除以16等于0.725，验证结果：",0.1+ 10/4 ** 2)

num = 0
# =	赋值运算符	把 = 号右边的结果赋给左边的变量，如 num = 1+2，结果num的值为3
# +=	加法赋值运算符	num += 2 等效于 num = num + 2
num += 2
print(f"num += 2 等效于 num = num + 2,即 num=0+2 所以结果是2，结果验证：{num}")
# -=	减法赋值运算符	num -= 2 等效于 num = num - 2
num -= 2     #注意此时num初始值已为2
print(f"num -= 2 等效于 num = num - 2,即 num=2-2 所以结果是0，结果验证：{num}")
# *=	乘法赋值运算符	num *= 2 等效于 num = num * 2
# /=	除法赋值运算符	num /= 2 等效于 num = num / 2
# %=	取模赋值运算符	num %= 2 等效于 num = num % 2
# //=	取整除赋值运算符	num //= 2 等效于 num = num // 2
# **=	幂赋/值运算符	num **= 2 等效于 num = num ** 2

# 比较运算符（也称关系运算符，用于比较两个值之间的关系。会计算运算符两边的表达式，
# 然后返回一个布尔值作为结果：True - 表示比较关系成立；False - 表示比较关系不成立）

#   ==	    等于	a == b        判断a是否等于b
#   !=	    不等于	a != b    判断a是否不等于b
#   >	    大于	a > b         判断a是否大于b
#   >=	    大于等于	a >= b    判断a是否大于等于b
#   <	    小于	a < b         判断a是否小于b
#   <=	    小于等于	a <= b    判断a是否小于b

# 逻辑运算符
# and(并且，同时成立)
# or(或者，满足其一)
# not(非，取反操作)

#案例：键盘输入一个数，判断是否在100-200之间
keyword = int(input("请输入一个数："))
print(f"{keyword}在100-200之间：",keyword >= 100 and keyword <= 200)
print(f"{keyword}在100-200之间：",100 <= keyword <= 200)
print(f"{keyword}在100-200之间：",keyword in range(100,200))